console.log('Hello world')

console.error('Error')

// если файлы слева подсвечиваются зеленым цветом - то они отслеживаются гитом
// чтобы отследить проверенные изменени в терминал git status
// если файлы красные в терминале - означает что мы их создали или изменили
// и для них нужно сделать запись в гит

// чтобы подготовить файлы к записи есть команда git add и через пробел все нужные файлы
// чтобы добавить все красные файлы git add .
// после этого в гит статус они подсветятся зеленым

// чтобы сделать запись
// git commit -m "comment" чтобы сделать запись (в коментариах описывается проделанная работа)

// чтобы посмотреть нашу запись git log
// чтобы посмотреть записи кратко git log --oneline

//изначально наша запись хранится на нашем компьютере, а чтобы её отправить на удаленный репозиторий
//git push [rep_link] [branch_name] 
//rep link - ссылка на репозиторий (можно посмотреть git remote -v)
// branch name - название ветки (пока хз что это) чтобы проверить её пишем git branche (в данном файле ее имя master)

// если файл был добвален в stage по ошибке его можно от туда удалить при помощи git reset (название файла)
// чтобы посмотреть все строки которые мы изменяли или добавляли git diff (модно указать название файла, чтобы посмотреть изменения конкретно в нём)
// если у строчки будет + то она добавлена, если - то она была удалена

// git reset --hard не только удалит фалы из стейдж но и исправит внесенные изменения


// в конце мы добавили файл gitignore  в которои прописываем файлы которые не нужно отправлять на репозиторий